# 本日使用到的初始設定

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
import matplotlib.pyplot as plt

In [6]:
import datetime 
from datetime import datetime, date

# 如何判別與處理資料遺漏

## 開始先建立 DataFrame

### 請注意如何形成 M xN 矩陣

In [8]:
df = pd.DataFrame(np.arange(0, 15).reshape(5,3),
                 index = ['a', 'b', 'c', 'd', 'e'],
                 columns = ['X', 'Y', 'Z'])
df

    X   Y   Z
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11
e  12  13  14

In [9]:
df['W1'] = np.nan

In [10]:
df

    X   Y   Z  W1
a   0   1   2 NaN
b   3   4   5 NaN
c   6   7   8 NaN
d   9  10  11 NaN
e  12  13  14 NaN

In [11]:
df.loc['f'] = np.arange(15, 19)

In [12]:
df

    X   Y   Z    W1
a   0   1   2   NaN
b   3   4   5   NaN
c   6   7   8   NaN
d   9  10  11   NaN
e  12  13  14   NaN
f  15  16  17  18.0

In [13]:
df.loc['g'] = np.nan

In [14]:
df

      X     Y     Z    W1
a   0.0   1.0   2.0   NaN
b   3.0   4.0   5.0   NaN
c   6.0   7.0   8.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   NaN
f  15.0  16.0  17.0  18.0
g   NaN   NaN   NaN   NaN

In [15]:
df['W2'] = np.nan

In [16]:
df

      X     Y     Z    W1  W2
a   0.0   1.0   2.0   NaN NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [17]:
df['W1']['a'] = 20 #先行後列

In [18]:
df

      X     Y     Z    W1  W2
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

## 開始進行判斷 NaN 及相關操作

In [19]:
df.isnull()

       X      Y      Z     W1    W2
a  False  False  False  False  True
b  False  False  False   True  True
c  False  False  False   True  True
d  False  False  False   True  True
e  False  False  False   True  True
f  False  False  False  False  True
g   True   True   True   True  True

In [20]:
df.notnull()

       X      Y      Z     W1     W2
a   True   True   True   True  False
b   True   True   True  False  False
c   True   True   True  False  False
d   True   True   True  False  False
e   True   True   True  False  False
f   True   True   True   True  False
g  False  False  False  False  False

In [21]:
df.count()

X     6
Y     6
Z     6
W1    2
W2    0
dtype: int64

In [22]:
df.copy()

      X     Y     Z    W1  W2
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [23]:
df

      X     Y     Z    W1  W2
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [25]:
df.fillna(0)

      X     Y     Z    W1   W2
a   0.0   1.0   2.0  20.0  0.0
b   3.0   4.0   5.0   0.0  0.0
c   6.0   7.0   8.0   0.0  0.0
d   9.0  10.0  11.0   0.0  0.0
e  12.0  13.0  14.0   0.0  0.0
f  15.0  16.0  17.0  18.0  0.0
g   0.0   0.0   0.0   0.0  0.0

In [26]:
df.dropna() #

Empty DataFrame
Columns: [X, Y, Z, W1, W2]
Index: []

In [27]:
df.isnull().sum()

X     1
Y     1
Z     1
W1    5
W2    7
dtype: int64

# NumPy vs. Pandas 處理 NaN 的差異

In [28]:
df.isnull()

       X      Y      Z     W1    W2
a  False  False  False  False  True
b  False  False  False   True  True
c  False  False  False   True  True
d  False  False  False   True  True
e  False  False  False   True  True
f  False  False  False  False  True
g   True   True   True   True  True

In [29]:
df.isnull().sum()

X     1
Y     1
Z     1
W1    5
W2    7
dtype: int64

In [30]:
df.isnull().sum().sum()

15

In [31]:
df.count()

X     6
Y     6
Z     6
W1    2
W2    0
dtype: int64

In [32]:
len(df)-df.count()

X     1
Y     1
Z     1
W1    5
W2    7
dtype: int64

In [33]:
(len(df)-df.count()).sum()

15

In [34]:
df.notnull()

       X      Y      Z     W1     W2
a   True   True   True   True  False
b   True   True   True  False  False
c   True   True   True  False  False
d   True   True   True  False  False
e   True   True   True  False  False
f   True   True   True   True  False
g  False  False  False  False  False

In [35]:
df.W1[df.W1.notnull()]

a    20.0
f    18.0
Name: W1, dtype: float64

In [36]:
df

      X     Y     Z    W1  W2
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [37]:
df.W1.dropna()

a    20.0
f    18.0
Name: W1, dtype: float64

In [38]:
df.W1

a    20.0
b     NaN
c     NaN
d     NaN
e     NaN
f    18.0
g     NaN
Name: W1, dtype: float64

In [39]:
df.dropna()

Empty DataFrame
Columns: [X, Y, Z, W1, W2]
Index: []

In [40]:
df.dropna(how='all')

      X     Y     Z    W1  W2
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN

In [41]:
df.dropna(how='all',axis=1)

      X     Y     Z    W1
a   0.0   1.0   2.0  20.0
b   3.0   4.0   5.0   NaN
c   6.0   7.0   8.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   NaN
f  15.0  16.0  17.0  18.0
g   NaN   NaN   NaN   NaN

# 16

In [42]:
df2 = df.copy()

In [43]:
df2.loc['g'].X = 0

In [44]:
df2.loc['g'].Z = 0

In [45]:
df2

      X     Y     Z    W1  W2
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   0.0   NaN   0.0   NaN NaN

In [46]:
df2.dropna(how='any', axis=1)

      X     Z
a   0.0   2.0
b   3.0   5.0
c   6.0   8.0
d   9.0  11.0
e  12.0  14.0
f  15.0  17.0
g   0.0   0.0

In [48]:
df2.dropna(thresh=4, axis=1) # Nan達四個門檻

      X     Y     Z
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   6.0   7.0   8.0
d   9.0  10.0  11.0
e  12.0  13.0  14.0
f  15.0  16.0  17.0
g   0.0   NaN   0.0

## 超級比一比 看看發生啥事

In [49]:
a = np.array([1, 2, np.nan, 3])
s = pd.Series(a)
a.mean() # numpy 遇 nan 不計算

nan

In [52]:
s.mean() # pandas 跳過nan

2.0

In [53]:
s = df.W1

In [54]:
s

a    20.0
b     NaN
c     NaN
d     NaN
e     NaN
f    18.0
g     NaN
Name: W1, dtype: float64

In [55]:
s.sum()

38.0

In [56]:
s.mean()

19.0

In [57]:
s.cumsum()

a    20.0
b     NaN
c     NaN
d     NaN
e     NaN
f    38.0
g     NaN
Name: W1, dtype: float64

In [58]:
df.W1 + 1

a    21.0
b     NaN
c     NaN
d     NaN
e     NaN
f    19.0
g     NaN
Name: W1, dtype: float64

In [59]:
filled = df.fillna(0)

In [60]:
filled

      X     Y     Z    W1   W2
a   0.0   1.0   2.0  20.0  0.0
b   3.0   4.0   5.0   0.0  0.0
c   6.0   7.0   8.0   0.0  0.0
d   9.0  10.0  11.0   0.0  0.0
e  12.0  13.0  14.0   0.0  0.0
f  15.0  16.0  17.0  18.0  0.0
g   0.0   0.0   0.0   0.0  0.0

In [61]:
df.mean()

X      7.5
Y      8.5
Z      9.5
W1    19.0
W2     NaN
dtype: float64

In [62]:
filled.mean()

X     6.428571
Y     7.285714
Z     8.142857
W1    5.428571
W2    0.000000
dtype: float64

In [63]:
df.fillna(df.mean())

      X     Y     Z    W1  W2
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0  19.0 NaN
c   6.0   7.0   8.0  19.0 NaN
d   9.0  10.0  11.0  19.0 NaN
e  12.0  13.0  14.0  19.0 NaN
f  15.0  16.0  17.0  18.0 NaN
g   7.5   8.5   9.5  19.0 NaN

In [64]:
df.W1.fillna(method='ffill')

a    20.0
b    20.0
c    20.0
d    20.0
e    20.0
f    18.0
g    18.0
Name: W1, dtype: float64

In [65]:
df

      X     Y     Z    W1  W2
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [66]:
df.W1.fillna(method="bfill")

a    20.0
b    18.0
c    18.0
d    18.0
e    18.0
f    18.0
g     NaN
Name: W1, dtype: float64

# 內插補值和資料處理

In [67]:
s = pd.Series([1, np.nan, np.nan, np.nan, 2])

In [68]:
s.interpolate()

0    1.00
1    1.25
2    1.50
3    1.75
4    2.00
dtype: float64

In [70]:
s = pd.Series([0, np.nan, 100], index=[0, 1, 10])

In [71]:
s

0       0.0
1       NaN
10    100.0
dtype: float64

In [72]:
s.interpolate()

0       0.0
1      50.0
10    100.0
dtype: float64

In [75]:
s.interpolate(method='values')

0       0.0
1      10.0
10    100.0
dtype: float64

In [76]:
ts = pd.Series([1, np.nan, 2],
              index = [datetime(2014, 1, 1),
                      datetime(2014, 2, 1),
                      datetime(2014, 4, 4)])
ts

2014-01-01    1.0
2014-02-01    NaN
2014-04-04    2.0
dtype: float64

In [77]:
ts.interpolate()

2014-01-01    1.0
2014-02-01    1.5
2014-04-04    2.0
dtype: float64

In [78]:
ts.interpolate(method='time')

2014-01-01    1.000000
2014-02-01    1.333333
2014-04-04    2.000000
dtype: float64

In [80]:
data = pd.DataFrame({'a':['x']*3 + ['y']*4, 'b':[1, 1, 2, 3, 3, 4, 4]})

In [81]:
data

   a  b
0  x  1
1  x  1
2  x  2
3  y  3
4  y  3
5  y  4
6  y  4

In [83]:
data.duplicated

<bound method DataFrame.duplicated of    a  b
0  x  1
1  x  1
2  x  2
3  y  3
4  y  3
5  y  4
6  y  4>

# 22

In [84]:
data.drop_duplicates()

   a  b
0  x  1
2  x  2
3  y  3
5  y  4

In [85]:
data.drop_duplicates().count()

a    4
b    4
dtype: int64

In [86]:
data.drop_duplicates(keep='last')

   a  b
1  x  1
2  x  2
4  y  3
6  y  4

In [87]:
data['c'] = range(7)

In [88]:
data

   a  b  c
0  x  1  0
1  x  1  1
2  x  2  2
3  y  3  3
4  y  3  4
5  y  4  5
6  y  4  6

In [89]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [90]:
data.drop_duplicates(['a', 'b'])

   a  b  c
0  x  1  0
2  x  2  2
3  y  3  3
5  y  4  5

In [92]:
x = pd.Series({'one':1, 'two':2, 'three':3})
y = pd.Series({1:'a', 2:'b', 3:'c'})
x

one      1
two      2
three    3
dtype: int64

In [93]:
y

1    a
2    b
3    c
dtype: object

In [94]:
x.map(y)

one      a
two      b
three    c
dtype: object

In [95]:
z = pd.Series({1:'a', 2:'b'})

In [96]:
x.map(z)

one        a
two        b
three    NaN
dtype: object

# 24